#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/KandJ.wedding/KandJ.wedding/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/KandJ.wedding/KandJ.wedding

To view this run in a browser, visit:
https://app.terraform.io/app/jamcswain/KandJ-wedding/runs/run-5TZNrDX5UynuQLhw

Waiting for the plan to start...

Terraform v1.2.7
on linux_amd64
Initializing plugins and modules...
data.cloudflare_zone.site-zone: Refreshing...
aws_cloudfront_origin_access_identity.cloudfront: Refreshing state... [id=E2403R73NDYXJX]
aws_acm_certificate.site: Refreshing state... [id=arn:aws:acm:us-east-1:803205869942:certificate/589bac61-026b-4e30-8e22-bad100d17fec]
aws_s3_bucket.site-bucket: Refreshing state... [id=kandj.wedding]
data.cloudflare_zone.site-zone: Refresh complete after 0s [id=ec83b05335e3340b4e8277936802528b]
cloudflare_record.www: Refreshing state... [id=8f687189417133212df408e587c88114]
cloudflare_record.caa-wild: Refreshing state... [id=f91dd16665978e92c53e1a6f212e9dc6]
cloudflare_record.caa: Refreshing state... [id=211e5390a67cf13562e3554688b14a69]
data.aws_iam_policy_document.allow-public: Refreshing...
data.aws_iam_policy_document.allow-public: Refresh complete after 0s [id=657522247]
aws_s3_object.dist-txt["robots.txt"]: Refreshing state... [id=robots.txt]
aws_s3_object.dist-svg["safari-pinned-tab.svg"]: Refreshing state... [id=safari-pinned-tab.svg]
aws_s3_object.dist-js["Dresscode.1495e730980539a7.js"]: Refreshing state... [id=Dresscode.1495e730980539a7.js]
aws_s3_object.dist-js["CodeOfConduct.de0c0e983703414b.js"]: Refreshing state... [id=CodeOfConduct.de0c0e983703414b.js]
aws_s3_object.dist-js["chunk-vendors.9c4a68f0c730ca23.js"]: Refreshing state... [id=chunk-vendors.9c4a68f0c730ca23.js]
aws_s3_object.dist-js["RSVP.0f4ad2b9878f0564.js"]: Refreshing state... [id=RSVP.0f4ad2b9878f0564.js]
aws_s3_object.dist-js["app.5620bb415439247a.js"]: Refreshing state... [id=app.5620bb415439247a.js]
aws_s3_object.dist-js["Main.de64ec8528d264f2.js"]: Refreshing state... [id=Main.de64ec8528d264f2.js]
aws_s3_object.dist-js["Location.f00ecb5adda7e7f5.js"]: Refreshing state... [id=Location.f00ecb5adda7e7f5.js]
aws_s3_object.dist-xml["browserconfig.xml"]: Refreshing state... [id=browserconfig.xml]
aws_s3_object.dist-xml["sitemap.xml"]: Refreshing state... [id=sitemap.xml]
aws_s3_object.dist-html["index.html"]: Refreshing state... [id=index.html]
aws_s3_bucket_acl.public-bucket: Refreshing state... [id=kandj.wedding,private]
aws_s3_bucket_policy.allow-public: Refreshing state... [id=kandj.wedding]
aws_s3_object.dist-img["parking.5316f10f.png"]: Refreshing state... [id=img/parking.5316f10f.png]
aws_s3_object.dist-img["ring_day.cdde60b5.png"]: Refreshing state... [id=img/ring_day.cdde60b5.png]
aws_s3_object.dist-img["ring_overlay_night.58d2271b.png"]: Refreshing state... [id=img/ring_overlay_night.58d2271b.png]
aws_s3_object.dist-ico["favicon.ico"]: Refreshing state... [id=favicon.ico]
aws_s3_object.dist-webmanifest["site.webmanifest"]: Refreshing state... [id=site.webmanifest]
aws_s3_object.dist-css["Main.a98858a18b84920e.css"]: Refreshing state... [id=Main.a98858a18b84920e.css]
aws_s3_object.dist-css["Dresscode.38238dc4ecbddce2.css"]: Refreshing state... [id=Dresscode.38238dc4ecbddce2.css]
aws_s3_object.dist-css["app.c12b1e460fa7889f.css"]: Refreshing state... [id=app.c12b1e460fa7889f.css]
aws_s3_object.dist-css["chunk-vendors.ba72c83388e5e82f.css"]: Refreshing state... [id=chunk-vendors.ba72c83388e5e82f.css]
aws_s3_object.dist-png["apple-touch-icon-144x144-precomposed.png"]: Refreshing state... [id=apple-touch-icon-144x144-precomposed.png]
aws_s3_object.dist-png["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
aws_s3_object.dist-png["android-chrome-144x144.png"]: Refreshing state... [id=android-chrome-144x144.png]
aws_s3_object.dist-png["mstile-310x310.png"]: Refreshing state... [id=mstile-310x310.png]
aws_s3_object.dist-png["android-chrome-72x72.png"]: Refreshing state... [id=android-chrome-72x72.png]
aws_s3_object.dist-png["apple-touch-icon-60x60.png"]: Refreshing state... [id=apple-touch-icon-60x60.png]
aws_s3_object.dist-png["apple-touch-icon-76x76.png"]: Refreshing state... [id=apple-touch-icon-76x76.png]
aws_s3_object.dist-png["apple-touch-icon-57x57-precomposed.png"]: Refreshing state... [id=apple-touch-icon-57x57-precomposed.png]
aws_s3_object.dist-png["mstile-150x150.png"]: Refreshing state... [id=mstile-150x150.png]
aws_s3_object.dist-png["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
aws_s3_object.dist-png["apple-touch-icon-57x57.png"]: Refreshing state... [id=apple-touch-icon-57x57.png]
aws_s3_object.dist-png["apple-touch-icon-114x114-precomposed.png"]: Refreshing state... [id=apple-touch-icon-114x114-precomposed.png]
aws_s3_object.dist-png["apple-touch-icon-144x144.png"]: Refreshing state... [id=apple-touch-icon-144x144.png]
aws_s3_object.dist-png["apple-touch-icon-180x180-precomposed.png"]: Refreshing state... [id=apple-touch-icon-180x180-precomposed.png]
aws_s3_object.dist-png["apple-touch-icon-120x120-precomposed.png"]: Refreshing state... [id=apple-touch-icon-120x120-precomposed.png]
aws_s3_object.dist-png["apple-touch-icon-76x76-precomposed.png"]: Refreshing state... [id=apple-touch-icon-76x76-precomposed.png]
aws_s3_object.dist-png["apple-touch-icon-120x120.png"]: Refreshing state... [id=apple-touch-icon-120x120.png]
aws_s3_object.dist-png["apple-touch-icon-60x60-precomposed.png"]: Refreshing state... [id=apple-touch-icon-60x60-precomposed.png]
aws_s3_object.dist-png["android-chrome-96x96.png"]: Refreshing state... [id=android-chrome-96x96.png]
aws_s3_object.dist-png["android-chrome-48x48.png"]: Refreshing state... [id=android-chrome-48x48.png]
aws_s3_object.dist-png["apple-touch-icon-72x72.png"]: Refreshing state... [id=apple-touch-icon-72x72.png]
aws_s3_object.dist-png["android-chrome-256x256.png"]: Refreshing state... [id=android-chrome-256x256.png]
aws_s3_object.dist-png["apple-touch-icon-72x72-precomposed.png"]: Refreshing state... [id=apple-touch-icon-72x72-precomposed.png]
aws_s3_object.dist-png["apple-touch-icon.png"]: Refreshing state... [id=apple-touch-icon.png]
aws_s3_object.dist-png["android-chrome-192x192.png"]: Refreshing state... [id=android-chrome-192x192.png]
aws_s3_object.dist-png["mstile-310x150.png"]: Refreshing state... [id=mstile-310x150.png]
aws_s3_object.dist-png["mstile-70x70.png"]: Refreshing state... [id=mstile-70x70.png]
aws_s3_object.dist-png["apple-touch-icon-precomposed.png"]: Refreshing state... [id=apple-touch-icon-precomposed.png]
aws_s3_object.dist-png["apple-touch-icon-152x152-precomposed.png"]: Refreshing state... [id=apple-touch-icon-152x152-precomposed.png]
aws_s3_object.dist-png["mstile-144x144.png"]: Refreshing state... [id=mstile-144x144.png]
aws_s3_object.dist-png["apple-touch-icon-114x114.png"]: Refreshing state... [id=apple-touch-icon-114x114.png]
aws_s3_object.dist-png["android-chrome-36x36.png"]: Refreshing state... [id=android-chrome-36x36.png]
aws_s3_object.dist-png["apple-touch-icon-152x152.png"]: Refreshing state... [id=apple-touch-icon-152x152.png]
aws_s3_object.dist-png["social-media-banner.png"]: Refreshing state... [id=social-media-banner.png]
aws_s3_object.dist-png["apple-touch-icon-180x180.png"]: Refreshing state... [id=apple-touch-icon-180x180.png]
cloudflare_record.validation["www.kandj.wedding"]: Refreshing state... [id=bf556ea619c411362572c1a502d8f0f4]
cloudflare_record.validation["kandj.wedding"]: Refreshing state... [id=47a647ba5a97ed2066e37c38665c47f6]
aws_acm_certificate_validation.validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2M6I7D561Q0BH]
cloudflare_record.root: Refreshing state... [id=413ae66a4542c896b16f4fe24d3746bd]
aws_s3_bucket.site-bucket: Drift detected (update)
aws_s3_object.dist-js["CodeOfConduct.de0c0e983703414b.js"]: Drift detected (update)
aws_s3_object.dist-js["Dresscode.1495e730980539a7.js"]: Drift detected (update)
aws_s3_object.dist-js["Location.f00ecb5adda7e7f5.js"]: Drift detected (update)
aws_s3_object.dist-js["Main.de64ec8528d264f2.js"]: Drift detected (update)
aws_s3_object.dist-js["RSVP.0f4ad2b9878f0564.js"]: Drift detected (update)
aws_s3_object.dist-js["app.5620bb415439247a.js"]: Drift detected (update)
aws_s3_bucket_policy.allow-public: Drift detected (update)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_bucket.site-bucket has changed
  ~ resource "aws_s3_bucket" "site-bucket" {
      ~ bucket_regional_domain_name = "kandj.wedding.s3.amazonaws.com" -> "kandj.wedding.s3.us-east-1.amazonaws.com"
        id                          = "kandj.wedding"
        tags                        = {
            "Name" = "kandj.wedding"
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "E2M6I7D561Q0BH"
        tags                           = {}
        # (19 unchanged attributes hidden)

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "kandj.wedding.s3.amazonaws.com" -> null
          - origin_id           = "kandj.wedding" -> null

          - s3_origin_config {
              - origin_access_identity = "origin-access-identity/cloudfront/E2403R73NDYXJX" -> null
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "kandj.wedding.s3.us-east-1.amazonaws.com"
          + origin_id           = "kandj.wedding"

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E2403R73NDYXJX"
            }
        }

        # (5 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.allow-public will be updated in-place
  ~ resource "aws_s3_bucket_policy" "allow-public" {
        id     = "kandj.wedding"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = "*" -> {
                          + "*" = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2403R73NDYXJX"
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_s3_object.dist-css["Dresscode.38238dc4ecbddce2.css"] will be updated in-place
  ~ resource "aws_s3_object" "dist-css" {
      - acl                = "private" -> null
        id                 = "Dresscode.38238dc4ecbddce2.css"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-css["Main.a98858a18b84920e.css"] will be updated in-place
  ~ resource "aws_s3_object" "dist-css" {
      - acl                = "private" -> null
        id                 = "Main.a98858a18b84920e.css"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-css["app.c12b1e460fa7889f.css"] will be updated in-place
  ~ resource "aws_s3_object" "dist-css" {
      - acl                = "private" -> null
        id                 = "app.c12b1e460fa7889f.css"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-css["chunk-vendors.ba72c83388e5e82f.css"] will be updated in-place
  ~ resource "aws_s3_object" "dist-css" {
      - acl                = "private" -> null
        id                 = "chunk-vendors.ba72c83388e5e82f.css"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-html["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "dist-html" {
      - acl                    = "private" -> null
      ~ etag                   = "d4eb3614c29577c3efffef5753e5e8ed" -> "63464f8e988af0de7fef71b041a9bb1f"
        id                     = "index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-ico["favicon.ico"] will be updated in-place
  ~ resource "aws_s3_object" "dist-ico" {
      - acl                = "private" -> null
        id                 = "favicon.ico"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-img["parking.5316f10f.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-img" {
      - acl                = "private" -> null
        id                 = "img/parking.5316f10f.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-img["ring_day.cdde60b5.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-img" {
      - acl                = "private" -> null
        id                 = "img/ring_day.cdde60b5.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-img["ring_overlay_night.58d2271b.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-img" {
      - acl                = "private" -> null
        id                 = "img/ring_overlay_night.58d2271b.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-js["CodeOfConduct.0dafc118daf2ddb3.js"] will be created
  + resource "aws_s3_object" "dist-js" {
      + bucket                 = "kandj.wedding"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "ed1fd7c94687a725604a13d549984953"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "CodeOfConduct.0dafc118daf2ddb3.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/CodeOfConduct.0dafc118daf2ddb3.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.dist-js["CodeOfConduct.de0c0e983703414b.js"] will be destroyed
  # (because key ["CodeOfConduct.de0c0e983703414b.js"] is not in for_each map)
  - resource "aws_s3_object" "dist-js" {
      - acl                    = "private" -> null
      - bucket                 = "kandj.wedding" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "e0326184c7336a9bd85e63bcd4b7b203" -> null
      - force_destroy          = false -> null
      - id                     = "CodeOfConduct.de0c0e983703414b.js" -> null
      - key                    = "CodeOfConduct.de0c0e983703414b.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/CodeOfConduct.de0c0e983703414b.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.dist-js["Dresscode.1495e730980539a7.js"] will be destroyed
  # (because key ["Dresscode.1495e730980539a7.js"] is not in for_each map)
  - resource "aws_s3_object" "dist-js" {
      - acl                    = "private" -> null
      - bucket                 = "kandj.wedding" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "07600fb6a0d241c2679f82cf72d943de" -> null
      - force_destroy          = false -> null
      - id                     = "Dresscode.1495e730980539a7.js" -> null
      - key                    = "Dresscode.1495e730980539a7.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/Dresscode.1495e730980539a7.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.dist-js["Dresscode.4c5b05bcb92706ca.js"] will be created
  + resource "aws_s3_object" "dist-js" {
      + bucket                 = "kandj.wedding"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "e99d8a06971b6e5dc850c07c0f577d65"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "Dresscode.4c5b05bcb92706ca.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/Dresscode.4c5b05bcb92706ca.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.dist-js["Location.d3268e261769dc0c.js"] will be created
  + resource "aws_s3_object" "dist-js" {
      + bucket                 = "kandj.wedding"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "ab1acd6618f12474d36c806a2ec0bf0b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "Location.d3268e261769dc0c.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/Location.d3268e261769dc0c.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.dist-js["Location.f00ecb5adda7e7f5.js"] will be destroyed
  # (because key ["Location.f00ecb5adda7e7f5.js"] is not in for_each map)
  - resource "aws_s3_object" "dist-js" {
      - acl                    = "private" -> null
      - bucket                 = "kandj.wedding" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "e9455b442b3a1e354f2b36d7e6291e77" -> null
      - force_destroy          = false -> null
      - id                     = "Location.f00ecb5adda7e7f5.js" -> null
      - key                    = "Location.f00ecb5adda7e7f5.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/Location.f00ecb5adda7e7f5.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.dist-js["Main.be622a3b4950c5e7.js"] will be created
  + resource "aws_s3_object" "dist-js" {
      + bucket                 = "kandj.wedding"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "dd902486cd0d1953414fb293312fd814"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "Main.be622a3b4950c5e7.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/Main.be622a3b4950c5e7.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.dist-js["Main.de64ec8528d264f2.js"] will be destroyed
  # (because key ["Main.de64ec8528d264f2.js"] is not in for_each map)
  - resource "aws_s3_object" "dist-js" {
      - acl                    = "private" -> null
      - bucket                 = "kandj.wedding" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "3a758573f1cd3e72e2b571b1db0e1549" -> null
      - force_destroy          = false -> null
      - id                     = "Main.de64ec8528d264f2.js" -> null
      - key                    = "Main.de64ec8528d264f2.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/Main.de64ec8528d264f2.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.dist-js["RSVP.0f4ad2b9878f0564.js"] will be destroyed
  # (because key ["RSVP.0f4ad2b9878f0564.js"] is not in for_each map)
  - resource "aws_s3_object" "dist-js" {
      - acl                    = "private" -> null
      - bucket                 = "kandj.wedding" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "67593e0241a6aea024e40c380cb778a1" -> null
      - force_destroy          = false -> null
      - id                     = "RSVP.0f4ad2b9878f0564.js" -> null
      - key                    = "RSVP.0f4ad2b9878f0564.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/RSVP.0f4ad2b9878f0564.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.dist-js["RSVP.49f344f6e83828aa.js"] will be created
  + resource "aws_s3_object" "dist-js" {
      + bucket                 = "kandj.wedding"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "4f0f3c19b894de5406776c4b17ec53de"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "RSVP.49f344f6e83828aa.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/RSVP.49f344f6e83828aa.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.dist-js["app.5620bb415439247a.js"] will be destroyed
  # (because key ["app.5620bb415439247a.js"] is not in for_each map)
  - resource "aws_s3_object" "dist-js" {
      - acl                    = "private" -> null
      - bucket                 = "kandj.wedding" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "a20d07bb0697c76ea10dc19bc3299f1a" -> null
      - force_destroy          = false -> null
      - id                     = "app.5620bb415439247a.js" -> null
      - key                    = "app.5620bb415439247a.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/app.5620bb415439247a.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.dist-js["app.aba546047ff8b1d2.js"] will be created
  + resource "aws_s3_object" "dist-js" {
      + bucket                 = "kandj.wedding"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "6f023828ea77fc782d56b371c13e1284"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "app.aba546047ff8b1d2.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/app.aba546047ff8b1d2.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.dist-js["chunk-vendors.9c4a68f0c730ca23.js"] will be updated in-place
  ~ resource "aws_s3_object" "dist-js" {
      - acl                    = "private" -> null
        id                     = "chunk-vendors.9c4a68f0c730ca23.js"
        tags                   = {}
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["android-chrome-144x144.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "android-chrome-144x144.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["android-chrome-192x192.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "android-chrome-192x192.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["android-chrome-256x256.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "android-chrome-256x256.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["android-chrome-36x36.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "android-chrome-36x36.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["android-chrome-48x48.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "android-chrome-48x48.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["android-chrome-72x72.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "android-chrome-72x72.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["android-chrome-96x96.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "android-chrome-96x96.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-114x114-precomposed.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-114x114-precomposed.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-114x114.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-114x114.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-120x120-precomposed.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-120x120-precomposed.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-120x120.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-120x120.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-144x144-precomposed.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-144x144-precomposed.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-144x144.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-144x144.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-152x152-precomposed.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-152x152-precomposed.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-152x152.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-152x152.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-180x180-precomposed.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-180x180-precomposed.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-180x180.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-180x180.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-57x57-precomposed.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-57x57-precomposed.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-57x57.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-57x57.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-60x60-precomposed.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-60x60-precomposed.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-60x60.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-60x60.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-72x72-precomposed.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-72x72-precomposed.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-72x72.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-72x72.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-76x76-precomposed.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-76x76-precomposed.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-76x76.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-76x76.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon-precomposed.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon-precomposed.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["apple-touch-icon.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["favicon-16x16.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "favicon-16x16.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["favicon-32x32.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "favicon-32x32.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["mstile-144x144.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "mstile-144x144.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["mstile-150x150.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "mstile-150x150.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["mstile-310x150.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "mstile-310x150.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["mstile-310x310.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "mstile-310x310.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["mstile-70x70.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "mstile-70x70.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-png["social-media-banner.png"] will be updated in-place
  ~ resource "aws_s3_object" "dist-png" {
      - acl                = "private" -> null
        id                 = "social-media-banner.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-svg["safari-pinned-tab.svg"] will be updated in-place
  ~ resource "aws_s3_object" "dist-svg" {
      - acl                = "private" -> null
        id                 = "safari-pinned-tab.svg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-txt["robots.txt"] will be updated in-place
  ~ resource "aws_s3_object" "dist-txt" {
      - acl                = "private" -> null
        id                 = "robots.txt"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-webmanifest["site.webmanifest"] will be updated in-place
  ~ resource "aws_s3_object" "dist-webmanifest" {
      - acl                = "private" -> null
        id                 = "site.webmanifest"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-xml["browserconfig.xml"] will be updated in-place
  ~ resource "aws_s3_object" "dist-xml" {
      - acl                = "private" -> null
        id                 = "browserconfig.xml"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.dist-xml["sitemap.xml"] will be updated in-place
  ~ resource "aws_s3_object" "dist-xml" {
      - acl                = "private" -> null
        id                 = "sitemap.xml"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

Plan: 6 to add, 52 to change, 6 to destroy.

```
</details>
*Pushed by: @USA-RedDragon, Action: `pull_request`*